[
  {
    "title": "Telegram-бот путеводитель по выставке",
    "is_published": 1,
    "description": "Написал телеграм-бота для дочерней компании Росатома. Он нужен был для стенда РЭНЕРА на выставке в Калининграде. Бот направлял людей в нужное место стенда, отправлял картинки, видео, телеграм-кружочки и в целом рассказывал о первом в России заводе по производству литий-ионных аккумуляторов. Сейчас не работает, потому что нужен был на один день.",
    "url": "https://t.me/renerator_bot",
    "github": "https://github.com/Lasellar/rosatom-bot",
    "is_commercial": 1
  },
  {
    "title": "Сайт, на котором Вы сейчас находитесь",
    "is_published": 1,
    "description": "Создал этот сайт с использованием большей части своего стека. Написал шаблоны страниц с помощью jinja2, настроил CI/CD с использованием Github Actions и Docker compose, а также настроил удаленный сервер, на котором он работает. Есть админка, через которую можно управлять контентом на страницах, а также реализована загрузка данных в базу данных из формата JSON.",
    "url": "#",
    "github": "https://github.com/Lasellar/myportfolio"
  },
  {
    "title": "Telegram-бот для бара Láchesis",
    "is_published": 1,
    "description": "Бот, через которого можно бронировать столики, связываться с ивент-менеджерами по поводу организации мероприятий, а также для обратной связи. Изначально еще можно было смотреть через него меню, но впоследствии от этого отказались.",
    "url": "https://t.me/lachesis_club_bot",
    "is_commercial": 1
  },
  {
    "title": "Foodgram",
    "is_published": 1,
    "description": "Сайт/соцсеть для рецептов еды, я написал для него REST API, с которым взаимодействовала фронтенд-часть приложения, написанная на React. Есть регистрация/аутентификация через токены djoser, система подписок на пользователей, а также админ-панель и Список покупок. Список покупок включает в себя список всех продуктов из рецептов, которые были в него добавлены, дополнительно его можно скачать как текстовый файл.",
    "github": "https://github.com/Lasellar/foodgram"
  },
  {
    "title": "Telegram-бот + парсер WB",
    "is_published": 1,
    "description": "Телеграм-бот, которому можно отправить ссылку на товар из маркетплейса WildBerries и в ответ получить архив, в котором находятся все изображения товара, на который ведет эта ссылка. Сейчас не работает",
    "github": "https://github.com/Lasellar/wb_to_jpg",
    "is_commercial": 1
  },
  {
    "title": "Эпатажность",
    "is_published": 1,
    "description": "Сайт-магазин для музыкальной группы. Я пишу бэкенд-часть приложения и занимаюсь CI/CD, а также настройкой сервера, на котором этот сайт будет работать. В числе моих задач стоит продумывание структуры проекта и написание работоспособного REST API, к которому будт обращаться фронтенд, написанный на React. Также к нему прилагается телеграм-бот, который имеет общую с бэкендом сайта базу данных и нужен для того, чтобы выдавать людям промокоды. В будущем дополнительно будет добавлена возможность оплачивать покупки прямо на сайте.",
    "github": "https://github.com/Lasellar/epatazhnost",
    "is_commercial": 1
  },
  {
    "title": "Telegram-бот для регистрации на туры",
    "is_published": 1,
    "description": "Бот узнает информацию о пользователе и передает ее людям, которые занимаются организацией туров по России.",
    "url": "https://t.me/DerevnyaTours_bot",
    "github": "https://github.com/Lasellar/DerevnyaTours_bot",
    "is_commercial": 1
  }
]